HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxLmu_bf.h
/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN17 */
#define IFX_LMU_ACCEN0_EN17_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN17 */
#define IFX_LMU_ACCEN0_EN17_OFF (17u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN18 */
#define IFX_LMU_ACCEN0_EN18_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN18 */
#define IFX_LMU_ACCEN0_EN18_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN18 */
#define IFX_LMU_ACCEN0_EN18_OFF (18u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN19 */
#define IFX_LMU_ACCEN0_EN19_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN19 */
#define IFX_LMU_ACCEN0_EN19_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN19 */
#define IFX_LMU_ACCEN0_EN19_OFF (19u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN20 */
#define IFX_LMU_ACCEN0_EN20_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN20 */
#define IFX_LMU_ACCEN0_EN20_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN20 */
#define IFX_LMU_ACCEN0_EN20_OFF (20u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN21 */
#define IFX_LMU_ACCEN0_EN21_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN21 */
#define IFX_LMU_ACCEN0_EN21_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN21 */
#define IFX_LMU_ACCEN0_EN21_OFF (21u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN22 */
#define IFX_LMU_ACCEN0_EN22_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN22 */
#define IFX_LMU_ACCEN0_EN22_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN22 */
#define IFX_LMU_ACCEN0_EN22_OFF (22u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN23 */
#define IFX_LMU_ACCEN0_EN23_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN23 */
#define IFX_LMU_ACCEN0_EN23_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN23 */
#define IFX_LMU_ACCEN0_EN23_OFF (23u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN24 */
#define IFX_LMU_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN24 */
#define IFX_LMU_ACCEN0_EN24_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN24 */
#define IFX_LMU_ACCEN0_EN24_OFF (24u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN25 */
#define IFX_LMU_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN25 */
#define IFX_LMU_ACCEN0_EN25_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN25 */
#define IFX_LMU_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN26 */
#define IFX_LMU_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN26 */
#define IFX_LMU_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN26 */
#define IFX_LMU_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN27 */
#define IFX_LMU_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN27 */
#define IFX_LMU_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN27 */
#define IFX_LMU_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN28 */
#define IFX_LMU_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN28 */
#define IFX_LMU_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN28 */
#define IFX_LMU_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN29 */
#define IFX_LMU_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN29 */
#define IFX_LMU_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN29 */
#define IFX_LMU_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN30 */
#define IFX_LMU_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN30 */
#define IFX_LMU_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN30 */
#define IFX_LMU_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_LMU_ACCEN0_Bits.EN31 */
#define IFX_LMU_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN0_Bits.EN31 */
#define IFX_LMU_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN0_Bits.EN31 */
#define IFX_LMU_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN32 */
#define IFX_LMU_ACCEN1_EN32_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN32 */
#define IFX_LMU_ACCEN1_EN32_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN32 */
#define IFX_LMU_ACCEN1_EN32_OFF (0u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN33 */
#define IFX_LMU_ACCEN1_EN33_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN33 */
#define IFX_LMU_ACCEN1_EN33_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN33 */
#define IFX_LMU_ACCEN1_EN33_OFF (1u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN34 */
#define IFX_LMU_ACCEN1_EN34_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN34 */
#define IFX_LMU_ACCEN1_EN34_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN34 */
#define IFX_LMU_ACCEN1_EN34_OFF (2u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN35 */
#define IFX_LMU_ACCEN1_EN35_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN35 */
#define IFX_LMU_ACCEN1_EN35_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN35 */
#define IFX_LMU_ACCEN1_EN35_OFF (3u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN36 */
#define IFX_LMU_ACCEN1_EN36_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN36 */
#define IFX_LMU_ACCEN1_EN36_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN36 */
#define IFX_LMU_ACCEN1_EN36_OFF (4u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN37 */
#define IFX_LMU_ACCEN1_EN37_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN37 */
#define IFX_LMU_ACCEN1_EN37_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN37 */
#define IFX_LMU_ACCEN1_EN37_OFF (5u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN38 */
#define IFX_LMU_ACCEN1_EN38_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN38 */
#define IFX_LMU_ACCEN1_EN38_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN38 */
#define IFX_LMU_ACCEN1_EN38_OFF (6u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN39 */
#define IFX_LMU_ACCEN1_EN39_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN39 */
#define IFX_LMU_ACCEN1_EN39_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN39 */
#define IFX_LMU_ACCEN1_EN39_OFF (7u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN40 */
#define IFX_LMU_ACCEN1_EN40_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN40 */
#define IFX_LMU_ACCEN1_EN40_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN40 */
#define IFX_LMU_ACCEN1_EN40_OFF (8u)

